benchmarks/gpt-oss-cpu/results/p4/TP4_DFLASH/humaneval_c32.log
/home/sysadmin/pramod/bench/.venv/bin/vllm bench serve --backend vllm --model gpt-oss-20b --tokenizer /home/sysadmin/pramod/bench/models/gpt-oss-20b --port 8100 --seed 0 --disable-tqdm --save-result --result-dir /home/sysadmin/pramod/bench/results/p4/TP4_DFLASH --result-filename humaneval_c32.json --percentile-metrics ttft,tpot,itl,e2el --metric-percentiles 50,90,99 --backend openai-chat --endpoint /v1/chat/completions --skip-chat-template --temperature 0 --dataset-name hf --dataset-path openai/openai_humaneval --hf-split test --hf-output-len 2048 --save-detailed --max-concurrency 32 --num-prompts 128 --metadata config=TP4_DFLASH workload=humaneval serve_extra=
WARNING 09-24 14:10:39 [importing.py:45] Triton is installed, but doesn't include CPU backend. Disabling Triton.
INFO 09-24 14:10:39 [importing.py:74] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-24 14:10:39 [importing.py:98] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 09-24 14:10:40 [argparse_utils.py:441] Found duplicate keys --backend
Using the latest cached version of the dataset since openai/openai_humaneval couldn't be found on the Hugging Face Hub (offline mode is enabled).
Found the latest cached dataset configuration 'openai_humaneval' at /home/sysadmin/.cache/huggingface/datasets/openai___openai_humaneval/openai_humaneval/0.0.0/7dce6050a7d6d172f3cc5c32aa97f52fa1a2e544 (last modified on Thu Sep 24 09:35:32 2026).
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x74365b9dbc40>, trust_remote_code=False, seed=0, num_prompts=128, dataset_name='hf', no_stream=False, dataset_path='openai/openai_humaneval', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split='test', hf_name=None, hf_output_len=2048, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/chat/completions', header=None, max_concurrency=32, model='gpt-oss-20b', input_len=None, output_len=None, tokenizer='/home/sysadmin/pramod/bench/models/gpt-oss-20b', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['config=TP4_DFLASH', 'workload=humaneval', 'serve_extra='], result_dir='/home/sysadmin/pramod/bench/results/p4/TP4_DFLASH', result_filename='humaneval_c32.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-fdc14273-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  138.12    
Total input tokens:                      25054     
Total generated tokens:                  111950    
Request throughput (req/s):              0.93      
Output token throughput (tok/s):         810.52    
Peak output token throughput (tok/s):    288.00    
Peak concurrent requests:                36.00     
Total token throughput (tok/s):          991.91    
---------------Time to First Token----------------
Mean TTFT (ms):                          435.84    
Median TTFT (ms):                        280.21    
P50 TTFT (ms):                           280.21    
P90 TTFT (ms):                           1223.36   
P99 TTFT (ms):                           1229.03   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.03     
Median TPOT (ms):                        34.39     
P50 TPOT (ms):                           34.39     
P90 TPOT (ms):                           39.24     
P99 TPOT (ms):                           41.26     
---------------Inter-token Latency----------------
Mean ITL (ms):                           112.27    
Median ITL (ms):                         115.07    
P50 ITL (ms):                            115.07    
P90 ITL (ms):                            120.89    
P99 ITL (ms):                            181.42    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          29586.66  
Median E2EL (ms):                        23522.42  
P50 E2EL (ms):                           23522.42  
P90 E2EL (ms):                           53337.43  
P99 E2EL (ms):                           75095.78  
---------------Speculative Decoding---------------
Acceptance rate (%):                     33.78     
Acceptance length:                       3.36      
Drafts:                                  33241     
Draft tokens:                            232687    
Accepted tokens:                         78608     
Per-position acceptance (%):
  Position 0:                            78.12     
  Position 1:                            54.65     
  Position 2:                            37.35     
  Position 3:                            25.81     
  Position 4:                            18.17     
  Position 5:                            12.97     
  Position 6:                            9.41      
==================================================